In [6]:
import pandas as pd
import numpy as np
import random as rand

In [3]:
 np.random.randint(10,18,7)

array([12, 10, 16, 17, 12, 12, 14])

In [ ]:
num_sample = 50
dataset_features = {'age':{'type':'integer','min':18,'max':65},
                   'income':{'type':'float','min':200000,'max':1500000},
                   'height':{'type':'float','min':1.5,'max':2.0},
                   'city':{'type':'categorical','choices':['New York','London','Paris','Tokyo']},
                   'score':{'type':'float','min':0,'max':100}
                   }
data = {}
for feature_name,parameters in dataset_features.items():
    if parameters['type'] == 'integer':
        data['feature_name'] = np.random.randint(parameters['min'],params['max']+1,num_samples);

In [23]:
np.random.seed(42)
num_sample = 50
dataset_features = {
    'age': {'type': 'integer', 'min': 18, 'max': 65},
    'income': {'type': 'float', 'min': 2000, 'max': 15000},
    'height': {'type': 'float', 'min': 1.5, 'max': 2.0},
    'city': {'type': 'categorical', 'choices': ['New York', 'London', 'Paris', 'Tokyo']},
    'score': {'type': 'float', 'min': 0, 'max': 100}
}

data = {}

for feature_name, parameters in dataset_features.items():
    if parameters['type'] == 'integer':
        data[feature_name] = np.random.randint(parameters['min'], parameters['max'] + 1, num_sample)
    elif parameters['type'] == 'float':
        data[feature_name] = np.random.uniform(parameters['min'], parameters['max'], num_sample)
    elif parameters['type'] == 'categorical':
        data[feature_name] = np.random.choice(parameters['choices'], num_sample)
data

{'age': array([56, 46, 32, 60, 25, 38, 56, 36, 40, 28, 28, 41, 53, 57, 41, 20, 39,
        19, 41, 61, 47, 55, 19, 38, 50, 29, 39, 61, 42, 44, 59, 45, 33, 32,
        64, 61, 20, 54, 24, 38, 26, 56, 35, 21, 42, 31, 26, 43, 19, 37]),
 'income': array([ 5133.33105834, 10882.42574473,  9929.95655117, 12831.53385257,
         4253.7404956 ,  7083.78789845,  4369.06914124, 11819.69833413,
         7527.02636839,  4703.24161729,  9380.10426166,  2407.07280192,
        12949.70206973,  7846.80373381,  7136.95306802, 14046.56525532,
        11454.53594613,  6245.02999448,  9415.77166727,  8770.84538034,
        14495.23631654, 12978.94003282, 11715.16143179,  9015.99772106,
         9627.76515363, 14548.31899443,  9891.44521993,  5587.98936629,
         5851.55557415,  4148.47020782,  2203.27328764,  7504.21924918,
         7133.45973628,  5815.34627133,  2183.0376953 ,  4584.95125315,
        11247.44538573, 12272.28202691,  9877.47967215, 14041.91142067,
        10464.00133153, 13894.47578207, 13050.50151127,  7842.8587638 ,
         3240.33151438,  6820.63727858, 10694.93628463, 10656.99063603,
         9686.8712402 ,  5571.38330887]),
 'height': array([1.78062171, 1.69146344, 1.98585605, 1.92445691, 1.86086476,
        1.61799246, 1.62803416, 1.52021679, 1.85533144, 1.55544541,
        1.71966825, 1.6008596 , 1.9478818 , 1.73768511, 1.78163779,
        1.84775804, 1.56966573, 1.80220869, 1.76992055, 1.60153061,
        1.97142679, 1.79943273, 1.84739247, 1.94023392, 1.81217702,
        1.64781684, 1.55274713, 1.72826729, 1.60922022, 1.70825497,
        1.94164013, 1.66217251, 1.56104398, 1.67814892, 1.95341422,
        1.63606612, 1.82384506, 1.50026019, 1.67628443, 1.65239063,
        1.58232793, 1.76704471, 1.74241499, 1.84621802, 1.63470617,
        1.62206276, 1.58414552, 1.60938211, 1.779051  , 1.70191809]),
 'city': array(['London', 'New York', 'London', 'Tokyo', 'Tokyo', 'London',
        'Paris', 'London', 'Paris', 'New York', 'New York', 'New York',
        'Tokyo', 'New York', 'Paris', 'New York', 'London', 'London',
        'Tokyo', 'London', 'Paris', 'New York', 'Tokyo', 'New York',
        'New York', 'Paris', 'London', 'London', 'New York', 'Tokyo',
        'London', 'Tokyo', 'London', 'Tokyo', 'Paris', 'Tokyo', 'Paris',
        'Paris', 'Tokyo', 'Paris', 'New York', 'Paris', 'London', 'Tokyo',
        'New York', 'Tokyo', 'London', 'London', 'London', 'Paris'],
       dtype='<U8'),
 'score': array([81.64318732, 79.8345125 , 15.0717544 , 50.81987767, 69.58128068,
        85.83588048, 32.59589052, 22.02410476, 71.11495324, 80.95010461,
        34.86659873,  9.61765511, 94.05232645, 39.75720211, 51.77513505,
        83.77101059, 67.5690117 , 73.52161192, 20.90716207, 54.14479738,
        69.57843993, 22.85500218, 17.49549271, 98.21683433, 51.66358913,
        26.08291748, 99.62536998, 96.54193513, 55.82934536, 88.26363432,
        18.87071083, 27.88713526, 70.035783  , 84.66611422, 85.63242919,
        40.45081271, 88.77700988, 85.09284488, 93.56349942, 78.53406511,
        66.89882547, 58.06866214, 37.22827666, 94.01334425, 97.36638368,
        28.39209747, 30.53638603, 48.56137536, 44.8424143 , 99.44574626])}

In [16]:
df = pd.DataFrame(data)
pd.set_option('display.float_format', '{:.2f}'.format)
df.head()

   age   income  height      city  score
0   42  5828.08    1.84     Paris  19.16
1   60  4723.16    1.77     Paris  38.49
2   64  5121.43    1.72     Tokyo   4.54
3   54 11938.25    1.96     Tokyo  84.21
4   36  7699.94    1.95  New York  24.96